results/rocm-640649/bench_suite_rocm.prefill.in16384.out32.c8.log
/opt/venv/lib/python3.12/site-packages/tvm_ffi/_optional_torch_c_dlpack.py:181: UserWarning: Failed to JIT torch c dlpack extension, EnvTensorAllocator will not be enabled.
We recommend installing via `pip install torch-c-dlpack-ext`
  warnings.warn(
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x15249f6bfba0>, trust_remote_code=False, seed=0, num_prompts=16, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=16384, random_output_len=32, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai-chat', base_url='http://172.28.9.152:8000', host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=8, model='/iopsstor/scratch/cscs/anowak/hf_cache/hub/models--zai-org--GLM-5.3/snapshots/aca966e4e02791568aa6a4ced368624b3d897f42', input_len=None, output_len=None, tokenizer='/iopsstor/scratch/cscs/anowak/hf_cache/hub/models--zai-org--GLM-5.3/snapshots/aca966e4e02791568aa6a4ced368624b3d897f42', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, self_timed=None, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-dacd74c9-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name='glm-5.3', lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 09-18 00:03:32 [utils.py:90] Sampling input_len from [16384, 16384] and output_len from [32, 32]
WARNING: /tokenize unavailable, skipping alignment.
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 8

  0%|          | 0/16 [00:00<?, ?it/s]
  6%|▋         | 1/16 [01:39<24:58, 99.92s/it]
 31%|███▏      | 5/16 [01:49<03:06, 16.96s/it]
 38%|███▊      | 6/16 [01:50<02:12, 13.23s/it]
 50%|█████     | 8/16 [01:56<01:12,  9.07s/it]
 56%|█████▋    | 9/16 [03:26<03:09, 27.10s/it]
 62%|██████▎   | 10/16 [03:27<02:05, 20.87s/it]
 81%|████████▏ | 13/16 [03:31<00:32, 10.83s/it]
 88%|████████▊ | 14/16 [03:31<00:17,  8.78s/it]
100%|██████████| 16/16 [03:32<00:00,  5.84s/it]
100%|██████████| 16/16 [03:32<00:00, 13.28s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     16
Failed requests:                         0
Maximum request concurrency:             8
Benchmark duration (s):                  212.50
Total input tokens:                      262336
Total generated tokens:                  512
Request throughput (req/s):              0.08
Output token throughput (tok/s):         2.41
Peak output token throughput (tok/s):    29.00
Peak concurrent requests:                12.00
Total token throughput (tok/s):          1236.91
---------------Time to First Token----------------
Mean TTFT (ms):                          89314.59
Median TTFT (ms):                        91198.06
P99 TTFT (ms):                           94829.10
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          498.28
Median TPOT (ms):                        545.95
P99 TPOT (ms):                           678.10
---------------Inter-token Latency----------------
Mean ITL (ms):                           530.36
Median ITL (ms):                         307.59
P99 ITL (ms):                            1830.29
==================================================